; domain
(define (domain lunar-lockout)
    (:requirements :strips :typing :adl :equality :fluents)

    (:types
        coord - number
        spacecraft - object
    )

    (:functions
        (movements)
    )

    (:predicates
        (at ?s - spacecraft ?x ?y - coord)
        (empty ?x ?y - coord)
        (next ?x ?y - coord)
        (adjacent ?x ?y - coord)
    )

    (:action move-up
        :parameters (?ship - spacecraft ?x ?y ?xtarget - coord)

        :precondition (and
            (at ?ship ?x ?y)                                        ; Spacecraft is at the given coordinates.
            (empty ?xtarget ?y)                                     ; The target cell is empty
            (next ?xtarget ?x)                                      ; The current cell x is below the target xtarget

            (exists (?limit - spacecraft ?xlimit - coord) (and      ; It exists an spacecraft that limits the movement
                (at ?limit ?xlimit ?y)                              ; located at <xblock, y> (same column)
                (adjacent ?xlimit ?xtarget)                         ; right above the target cell.
            ))

            (forall (?obstacle - spacecraft ?xobstacle - coord) 
                (not (and                                           ; Is not valid if:
                    (not (= ?ship ?obstacle))                       ; 1) The obstacle is the same spacecraft
                    (at ?obstacle ?xobstacle ?y)                    ; 2) There is an obstacle at <xobstaacle, y>
                    (next ?xtarget ?xobstacle)                      ;    - that is below the xblock 
                    (not (next ?x ?xobstacle))                      ;    - and above the spaceraft x
                ))
            )
        )

        :effect (and
            (not (at ?ship ?x ?y)) (empty ?x ?y)                    ; We remove the ship from the current cell and mark it as empty.
            (at ?ship ?xtarget ?y) (not (empty ?xtarget ?y))        ; We set the ship in the new cell and unmark it as empty.
            (increase (movements) 1)
        )
    )

    (:action move-down
        :parameters (?ship - spacecraft ?x ?y ?xtarget - coord)

        :precondition (and
            (at ?ship ?x ?y)                                        ; Spacecraft is at the given coordinates.
            (empty ?xtarget ?y)                                     ; The target cell is empty
            (next ?x ?xtarget)                                      ; The target cell xtarget is below the current x

            (exists (?limit - spacecraft ?xlimit - coord) (and      ; It exists an spacecraft that limits the movement
                (at ?limit ?xlimit ?y)                              ; located at <xblock, y> (same column)
                (adjacent ?xtarget ?xlimit)                         ; right above the target cell.
            ))

            (forall (?obstacle - spacecraft ?xobstacle - coord) 
                (not (and                                           ; Is not valid if:
                    (not (= ?ship ?obstacle))                       ; 1) The obstacle is the same spacecraft
                    (at ?obstacle ?xobstacle ?y)                    ; 2) There is an obstacle at <xobstaacle, y>
                    (next ?xtarget ?xobstacle)                      ;    - that is below the xblock 
                    (not (next ?x ?xobstacle))                      ;    - and above the spaceraft x
                ))
            )
        )

        :effect (and
            (not (at ?ship ?x ?y)) (empty ?x ?y)                    ; We remove the ship from the current cell and mark it as empty.
            (at ?ship ?xtarget ?y) (not (empty ?xtarget ?y))        ; We set the ship in the new cell and unmark it as empty.
            (increase (movements) 1)
        )
    )

    (:action move-left
        :parameters (?ship - spacecraft ?x ?y ?ytarget - coord)

        :precondition (and
            (at ?ship ?x ?y)                                        ; Spacecraft is at the given coordinates.
            (empty ?x ?ytarget)                                     ; The target cell is empty
            (next ?ytarget ?y)                                      ; The target cell ytarget is before the current y

            (exists (?limit - spacecraft ?ylimit - coord) (and      ; It exists an spacecraft that limits the movement
                (at ?limit ?x ?ylimit)                              ; located at <x, yblock> (same row)
                (adjacent ?ylimit ?ytarget)                         ; right before the target cell.
            ))

            (forall (?obstacle - spacecraft ?yobstacle - coord) 
                (not (and                                           ; Is not valid if:
                    (not (= ?ship ?obstacle))                       ; 1) The obstacle is the same spacecraft
                    (at ?obstacle ?x ?yobstacle)                    ; 2) There is an obstacle at <xobstaacle, y>
                    (next ?ytarget ?yobstacle)                      ;    - that is after the ytarget 
                    (not (next ?y ?yobstacle))                      ;    - and before the spaceraft y
                ))
            )
        )

        :effect (and
            (not (at ?ship ?x ?y)) (empty ?x ?y)                    ; We remove the ship from the current cell and mark it as empty.
            (at ?ship ?x ?ytarget) (not (empty ?x ?ytarget))        ; We set the ship in the new cell and unmark it as empty.
            (increase (movements) 1)
        )
    )

    (:action move-right
        :parameters (?ship - spacecraft ?x ?y ?ytarget - coord)

        :precondition (and
            (at ?ship ?x ?y)                                        ; Spacecraft is at the given coordinates.
            (empty ?x ?ytarget)                                     ; The target cell is empty
            (next ?y ?ytarget)                                      ; The target cell ytarget is before the current y

            (exists (?limit - spacecraft ?ylimit - coord) (and      ; It exists an spacecraft that limits the movement
                (at ?limit ?x ?ylimit)                              ; located at <x, yblock> (same row)
                (adjacent ?ytarget ?ylimit)                         ; right before the target cell.
            ))

            (forall (?obstacle - spacecraft ?yobstacle - coord) 
                (not (and                                           ; Is not valid if:
                    (not (= ?ship ?obstacle))                       ; 1) The obstacle is the same spacecraft
                    (at ?obstacle ?x ?yobstacle)                    ; 2) There is an obstacle at <xobstaacle, y>
                    (next ?yobstacle ?ytarget)                      ;    - that is after the ytarget 
                    (not (next ?yobstacle ?y))                      ;    - and before the spaceraft y
                ))
            )
        )

        :effect (and
            (not (at ?ship ?x ?y)) (empty ?x ?y)                    ; We remove the ship from the current cell and mark it as empty.
            (at ?ship ?x ?ytarget) (not (empty ?x ?ytarget))        ; We set the ship in the new cell and unmark it as empty.
            (increase (movements) 1)
        )
    )
)

; problem
(define (problem lunar-lockout1)
    (:domain lunar-lockout)
    
    (:objects
        Red Orange Yellow Green Blue Purple - spacecraft
        C1 C2 C3 C4 C5 - coord
    )

    (:init
        ; Grid definition

        (= (movements) 0)

        (adjacent C1 C2)
        (next C1 C2) (next C1 C3) (next C1 C4) (next C1 C5)
        
        (adjacent C2 C3)
        (next C2 C3) (next C2 C4) (next C2 C5)
        
        (adjacent C3 C4)
        (next C3 C4) (next C3 C5)
        
        (adjacent C4 C5)
        (next C4 C5)

        ; Problem custom definition

		(at Orange C1 C1)
		(at Yellow C1 C3)
		(at Green C1 C5)
		(at Blue C3 C1)
		(at Purple C5 C1)
		(at Red C5 C5)

		(empty C1 C2)
		(empty C1 C4)
		(empty C2 C1)
		(empty C2 C2)
		(empty C2 C3)
		(empty C2 C4)
		(empty C2 C5)
		(empty C3 C2)
		(empty C3 C3)
		(empty C3 C4)
		(empty C3 C5)
		(empty C4 C1)
		(empty C4 C2)
		(empty C4 C3)
		(empty C4 C4)
		(empty C4 C5)
		(empty C5 C2)
		(empty C5 C3)
		(empty C5 C4)
    )

    (:goal (at Red C3 C3))

    (:metric minimize (movements))
)

; plan
1. (move-down blue c3 c1 c4)
   deleted: (at blue c3 c1) (empty c4 c1)
   added: (empty c3 c1) (at blue c4 c1)
   changed: (movements) from 0 to 1
   goals met: 0 of 1
2. (move-right orange c1 c1 c2)
   deleted: (at orange c1 c1) (empty c1 c2)
   added: (empty c1 c1) (at orange c1 c2)
   changed: (movements) from 1 to 2
   goals met: 0 of 1
3. (move-right purple c5 c1 c4)
   deleted: (at purple c5 c1) (empty c5 c4)
   added: (empty c5 c1) (at purple c5 c4)
   changed: (movements) from 2 to 3
   goals met: 0 of 1
4. (move-up red c5 c5 c2)
   deleted: (at red c5 c5) (empty c2 c5)
   added: (empty c5 c5) (at red c2 c5)
   changed: (movements) from 3 to 4
   goals met: 0 of 1
5. (move-right yellow c1 c3 c4)
   deleted: (at yellow c1 c3) (empty c1 c4)
   added: (empty c1 c3) (at yellow c1 c4)
   changed: (movements) from 4 to 5
   goals met: 0 of 1
6. (move-down yellow c1 c4 c4)
   deleted: (at yellow c1 c4) (empty c4 c4)
   added: (empty c1 c4) (at yellow c4 c4)
   changed: (movements) from 5 to 6
   goals met: 0 of 1
7. (move-left yellow c4 c4 c2)
   deleted: (at yellow c4 c4) (empty c4 c2)
   added: (empty c4 c4) (at yellow c4 c2)
   changed: (movements) from 6 to 7
   goals met: 0 of 1
8. (move-up yellow c4 c2 c2)
   deleted: (at yellow c4 c2) (empty c2 c2)
   added: (empty c4 c2) (at yellow c2 c2)
   changed: (movements) from 7 to 8
   goals met: 0 of 1
9. (move-left red c2 c5 c3)
   deleted: (at red c2 c5) (empty c2 c3)
   added: (empty c2 c5) (at red c2 c3)
   changed: (movements) from 8 to 9
   goals met: 0 of 1
10. (move-right orange c1 c2 c4)
   deleted: (at orange c1 c2) (empty c1 c4)
   added: (empty c1 c2) (at orange c1 c4)
   changed: (movements) from 9 to 10
   goals met: 0 of 1
11. (move-down orange c1 c4 c4)
   deleted: (at orange c1 c4) (empty c4 c4)
   added: (empty c1 c4) (at orange c4 c4)
   changed: (movements) from 10 to 11
   goals met: 0 of 1
12. (move-right blue c4 c1 c3)
   deleted: (at blue c4 c1) (empty c4 c3)
   added: (empty c4 c1) (at blue c4 c3)
   changed: (movements) from 11 to 12
   goals met: 0 of 1
13. (move-down red c2 c3 c3)
   deleted: (at red c2 c3) (empty c3 c3)
   added: (empty c2 c3) (at red c3 c3)
   changed: (movements) from 12 to 13
   goals met: 1 of 1
